Revit 2017 API
InternalDefinition Class
 This object represents a parameter definition in Autodesk Revit. Every parameter has a ParamDef object which defines what kind of parameter it is, its properties, its behavior, etc. The ParamDef class is a base class with various derived classes representing different kinds of parameters. ParamDefs serve the following purposes: Basic properties : name, ID, the group it appears in (in the UI), whether it is read only, etc. Formatting and parsing : converting values to and from display strings, implemented by subclasses. Defining the kind of parameter : the kind of data the parameter represents: length, text, material, level, etc. Defining the UI for the parameter : together with the corresponding ParameterUI subclass, determines what kind of control will be used for the parameter in properties grids: edit box, combo box, pushbutton, etc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class InternalDefinition : Definition,
	IDisposable
Visual Basic
Public Class InternalDefinition _
	Inherits Definition _
	Implements IDisposable
Visual C++
public ref class InternalDefinition : public Definition,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definition
 Autodesk.Revit.DB.InternalDefinition
See Also
InternalDefinition Members
Autodesk.Revit.DB Namespace